### DataFrame의 인덱스 다루기 - 2
- 새로운 행 인덱스를 생성 및 적용
- 메서드 : 변수명.reindex(새로운 인덱스, fill_value)

In [1]:
import pandas as pd

In [2]:
jumsu = {'name':['마징가', '태권V', '원더우먼'],
         'kor':[89, 90, 90],
         'eng':[10, 30, 90],
         'math':[30, 60, 90]}

In [3]:
jumsu_df = pd.DataFrame(jumsu)

In [4]:
jumsu_df

   name  kor  eng  math
0   마징가   89   10    30
1   태권V   90   30    60
2  원더우먼   90   90    90

In [5]:
# 행 인덱스를 새롭게 지정
new_index = ['r0', 'r1', 'r2']

df2 = jumsu_df.reindex(new_index) # 필요없는 행을 지워버림

In [6]:
df2 # 그래서 이 난리가 남.

   name  kor  eng  math
r0  NaN  NaN  NaN   NaN
r1  NaN  NaN  NaN   NaN
r2  NaN  NaN  NaN   NaN

In [7]:
new_index = [2, 0, 1, 3]

df2 = jumsu_df.reindex(new_index)

In [8]:
df2

   name   kor   eng  math
2  원더우먼  90.0  90.0  90.0
0   마징가  89.0  10.0  30.0
1   태권V  90.0  30.0  60.0
3   NaN   NaN   NaN   NaN

In [9]:
#  행 인덱스를 새롭게 생성 => 존재하지 핞는 행에 값 설정
df3 = jumsu_df.reindex([0, 'r0', 'r1', 2], fill_value=0)
df3

    name  kor  eng  math
0    마징가   89   10    30
r0     0    0    0     0
r1     0    0    0     0
2   원더우먼   90   90    90